<template>
  <v-container class="py-6">
    <h1 class="text-h5 font-weight-medium mb-6">Тестовое задание SquareGPS</h1>

    <section class="text-body-1 about-text">
      <p>
        Необходимо с помощью <strong>Vue.js</strong>, <strong>Vuex</strong>,
        <strong>VueRouter</strong>, <strong>Vuetify</strong> написать
        приложение. Хэдер приложения должен содержать меню из 2-х пунктов:
        <em>О задании</em> и <em>Карта</em>.
      </p>

      <h2 class="text-h6 mt-6 mb-2">Раздел “О задании”</h2>
      <p>В разделе должен быть текст этого задания, сверстанный аналогично.</p>

      <h2 class="text-h6 mt-6 mb-2">Раздел “Карта”</h2>
      <p>На экране должны быть карта и список:</p>

      <ol>
        <li>
          При клике на кнопку добавления, карта должна перейти в режим
          добавления маркера...
        </li>
        <li>При клике на маркер должна подсвечиваться запись в списке.</li>
        <li>
          При клике на запись в списке карта должна центрироваться на маркере.
        </li>
        <li>
          Маркеры должны храниться локально и не пропадать после перезагрузки
          страницы.
        </li>
        <li>В адресной строке должен отображаться id выбранного маркера.</li>
      </ol>

      <h2 class="text-h6 mt-6 mb-2">Дополнительно</h2>
      <ul>
        <li>Продумать отображение на мобильных устройствах.</li>
        <li>Предусмотреть локализацию.</li>
        <li>Написать 1 модульный тест с Jest.</li>
      </ul>
      <br />
      <p>
        <strong>Напоминание:</strong> тестовое задание призвано показать умение
        писать хороший модульный код, а также умение пользоваться указанными
        технологиями и не только. Этим кодом нужно гордиться.
      </p>
    </section>
    <v-img src="../assets/map_example.jpeg" aspect-ratio="1.7"></v-img>
  </v-container>
</template>

<script lang="ts">
import Vue from "vue";

export default Vue.extend({
  name: "AboutPage",

  data: () => ({
    //
  }),
});
</script>
